# 10. DataFrame 생성

## 91~100

In [1]:
import pandas as pd

In [2]:
data = [['김은수','박정민','이하나'], [35, 30, 28], ['과장','대리','대리']]

In [5]:
data = pd.DataFrame(data=data, columns=['이름','나이','직책'])

In [6]:
data

    이름   나이   직책
0  김은수  박정민  이하나
1   35   30   28
2   과장   대리   대리

In [7]:
data.T

      0   1   2
이름  김은수  35  과장
나이  박정민  30  대리
직책  이하나  28  대리

In [9]:
data1={'이름':['김은수','박정민','이하나'],'나이':[35, 30, 28],'직책':['과장','대리','대리']}

In [11]:
df=pd.DataFrame(data1, columns=data1.keys())

In [12]:
df

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [17]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)

In [14]:
df

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005760   ACTS  1185  1.28

In [22]:
import pandas as pd

index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]

In [23]:
pd.DataFrame(data=data, index=index, columns=columns)

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [28]:
import numpy as np

In [29]:
a= [0,1,2,3]
b= [4,5,6,7]

In [30]:
a

[0, 1, 2, 3]

In [31]:
b

[4, 5, 6, 7]

In [38]:
pd.DataFrame(np.arange(8).reshape(2,4))

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [39]:
import pandas as pd

index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]
df = pd.DataFrame(data=data, index=index, columns=columns)

In [40]:
df

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [41]:
df.reset_index()

    index    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [42]:
df.index

Index(['037730', '036360', '005760'], dtype='object')

In [43]:
df.columns

Index(['종목명', '현재가'], dtype='object')

In [44]:
d = {'col1': [1, 2], 'col2': [3, 4]}

In [45]:
d

{'col1': [1, 2], 'col2': [3, 4]}

In [46]:
df = pd.DataFrame(data= d,dtype=np.int8)

In [47]:
df

   col1  col2
0     1     3
1     2     4

# 11. 데이터프레임 인덱싱과 슬라이싱

## 101~110

In [48]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

In [49]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [50]:
df[['현재가']]

         현재가
종목코드
037730  1510
036360  1790
005760  1185

In [56]:
df.columns[1:]

Index(['현재가', '등락률'], dtype='object')

In [57]:
df.iloc[0]

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [58]:
df.iloc[-1]

종목명    ACTS
현재가    1185
등락률    1.28
Name: 005760, dtype: object

In [62]:
df.iloc[0::2]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [63]:
df.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [66]:
df.loc[['037730','005760']]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [68]:
df.iloc[0]['등락률']

7.36

In [69]:
df.iloc[0,2]

7.36

In [74]:
df.iat[0, 2]

7.36

In [75]:
df.at["037730", "등락률"]

7.36

## 111~120

In [76]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

In [77]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [78]:
df.loc['037730','등락률']

7.36

In [79]:
df.iloc[:2]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [80]:
df.loc[['037730','036360']]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [81]:
df.loc[:,'종목명']

종목코드
037730       3R
036360    3SOFT
005760     ACTS
Name: 종목명, dtype: object

In [82]:
df.iloc[:,0]

종목코드
037730       3R
036360    3SOFT
005760     ACTS
Name: 종목명, dtype: object

In [83]:
df.loc['037730',['종목명','현재가']]

종목명      3R
현재가    1510
Name: 037730, dtype: object

In [84]:
df.iloc[0,[0,1]]

종목명      3R
현재가    1510
Name: 037730, dtype: object

In [89]:
df.loc[['037730','036360'],['종목명','현재가']]

          종목명   현재가
종목코드
037730     3R  1510
036360  3SOFT  1790

In [92]:
df.iloc[[0,1],[0,1]]

          종목명   현재가
종목코드
037730     3R  1510
036360  3SOFT  1790

In [93]:
df.loc[:"036360", "현재가":"등락률"]

         현재가   등락률
종목코드
037730  1510  7.36
036360  1790  1.65